TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/bsl/secondary_bsl_uart/secondary_bsl.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
// @cliArgs --device "MSPM0L130X" --package "VQFN-32(RHB)" --part "Default"
// @v2CliArgs --device "MSPM0L1306" --package "VQFN-32(RHB)" 
// @cliArgs --board /ti/boards/LP_MSPM0L1306 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const NONMAIN       = scripting.addModule("/ti/driverlib/NONMAIN");
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
NONMAIN.staticWriteProtectionMainLow = 0xFFFFF00F;
NONMAIN.bslAltConfig                 = true;
NONMAIN.bslAltAddress                = 0x1041;
NONMAIN.nonmainWarning               = true;

ProjectConfig.genDisable = true;
scripting.suppress("Project Configuration File generation is disabled for this project\\. SysConfig Project Migration is not currently supported for this project\\.", ProjectConfig);
